ciaa/firmware_v1/externals/drivers/msp430/inc/msp430f5256.h
#define UCA3CTLW0_            0x0680    /* USCI A3 Control Word Register 0 */
sfrb(UCA3CTLW0_L , UCA3CTLW0_);
sfrb(UCA3CTLW0_H , UCA3CTLW0_+1);
sfrw(UCA3CTLW0, UCA3CTLW0_);
#define UCA3CTL1            UCA3CTLW0_L  /* USCI A3 Control Register 1 */
#define UCA3CTL0            UCA3CTLW0_H  /* USCI A3 Control Register 0 */
#define UCA3BRW_              0x0686    /* USCI A3 Baud Word Rate 0 */
sfrb(UCA3BRW_L , UCA3BRW_);
sfrb(UCA3BRW_H , UCA3BRW_+1);
sfrw(UCA3BRW, UCA3BRW_);
#define UCA3BR0             UCA3BRW_L /* USCI A3 Baud Rate 0 */
#define UCA3BR1             UCA3BRW_H /* USCI A3 Baud Rate 1 */
#define UCA3MCTL_             0x0688    /* USCI A3 Modulation Control */
sfrb(UCA3MCTL, UCA3MCTL_);
#define UCA3STAT_             0x068A    /* USCI A3 Status Register */
sfrb(UCA3STAT, UCA3STAT_);
#define UCA3RXBUF_            0x068C    /* USCI A3 Receive Buffer */
const_sfrb(UCA3RXBUF, UCA3RXBUF_);
#define UCA3TXBUF_            0x068E    /* USCI A3 Transmit Buffer */
sfrb(UCA3TXBUF, UCA3TXBUF_);
#define UCA3ABCTL_            0x0690    /* USCI A3 LIN Control */
sfrb(UCA3ABCTL, UCA3ABCTL_);
#define UCA3IRCTL_            0x0692    /* USCI A3 IrDA Transmit Control */
sfrb(UCA3IRCTL_L , UCA3IRCTL_);
sfrb(UCA3IRCTL_H , UCA3IRCTL_+1);
sfrw(UCA3IRCTL, UCA3IRCTL_);
#define UCA3IRTCTL          UCA3IRCTL_L  /* USCI A3 IrDA Transmit Control */
#define UCA3IRRCTL          UCA3IRCTL_H  /* USCI A3 IrDA Receive Control */
#define UCA3ICTL_             0x069C    /* USCI A3 Interrupt Enable Register */
sfrb(UCA3ICTL_L , UCA3ICTL_);
sfrb(UCA3ICTL_H , UCA3ICTL_+1);
sfrw(UCA3ICTL, UCA3ICTL_);
#define UCA3IE              UCA3ICTL_L  /* USCI A3 Interrupt Enable Register */
#define UCA3IFG             UCA3ICTL_H  /* USCI A3 Interrupt Flags Register */
#define UCA3IV_               0x069E    /* USCI A3 Interrupt Vector Register */
sfrw(UCA3IV, UCA3IV_);


/************************************************************
* USCI B3
************************************************************/
#define __MSP430_HAS_USCI_B3__        /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_B3__ 0x06A0
#define USCI_B3_BASE __MSP430_BASEADDRESS_USCI_B3__


#define UCB3CTLW0_            0x06A0    /* USCI B3 Control Word Register 0 */
sfrb(UCB3CTLW0_L , UCB3CTLW0_);
sfrb(UCB3CTLW0_H , UCB3CTLW0_+1);
sfrw(UCB3CTLW0, UCB3CTLW0_);
#define UCB3CTL1            UCB3CTLW0_L  /* USCI B3 Control Register 1 */
#define UCB3CTL0            UCB3CTLW0_H  /* USCI B3 Control Register 0 */
#define UCB3BRW_              0x06A6    /* USCI B3 Baud Word Rate 0 */
sfrb(UCB3BRW_L , UCB3BRW_);
sfrb(UCB3BRW_H , UCB3BRW_+1);
sfrw(UCB3BRW, UCB3BRW_);
#define UCB3BR0             UCB3BRW_L /* USCI B3 Baud Rate 0 */
#define UCB3BR1             UCB3BRW_H /* USCI B3 Baud Rate 1 */
#define UCB3STAT_             0x06AA    /* USCI B3 Status Register */
sfrb(UCB3STAT, UCB3STAT_);
#define UCB3RXBUF_            0x06AC    /* USCI B3 Receive Buffer */
const_sfrb(UCB3RXBUF, UCB3RXBUF_);
#define UCB3TXBUF_            0x06AE    /* USCI B3 Transmit Buffer */
sfrb(UCB3TXBUF, UCB3TXBUF_);
#define UCB3I2COA_            0x06B0    /* USCI B3 I2C Own Address */
sfrb(UCB3I2COA_L , UCB3I2COA_);
sfrb(UCB3I2COA_H , UCB3I2COA_+1);
sfrw(UCB3I2COA, UCB3I2COA_);
#define UCB3I2CSA_            0x06B2    /* USCI B3 I2C Slave Address */
sfrb(UCB3I2CSA_L , UCB3I2CSA_);
sfrb(UCB3I2CSA_H , UCB3I2CSA_+1);
sfrw(UCB3I2CSA, UCB3I2CSA_);
#define UCB3ICTL_             0x06BC    /* USCI B3 Interrupt Enable Register */
sfrb(UCB3ICTL_L , UCB3ICTL_);
sfrb(UCB3ICTL_H , UCB3ICTL_+1);
sfrw(UCB3ICTL, UCB3ICTL_);
#define UCB3IE              UCB3ICTL_L  /* USCI B3 Interrupt Enable Register */
#define UCB3IFG             UCB3ICTL_H  /* USCI B3 Interrupt Flags Register */
#define UCB3IV_               0x06BE    /* USCI B3 Interrupt Vector Register */
sfrw(UCB3IV, UCB3IV_);

/************************************************************
* WATCHDOG TIMER A
************************************************************/
#define __MSP430_HAS_WDT_A__          /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_WDT_A__ 0x0150
#define WDT_A_BASE __MSP430_BASEADDRESS_WDT_A__

#define WDTCTL_               0x015C    /* Watchdog Timer Control */
sfrb(WDTCTL_L , WDTCTL_);
sfrb(WDTCTL_H , WDTCTL_+1);
sfrw(WDTCTL, WDTCTL_);
/* The bit names have been prefixed with "WDT" */
/* WDTCTL Control Bits */
#define WDTIS0              (0x0001)  /* WDT - Timer Interval Select 0 */
#define WDTIS1              (0x0002)  /* WDT - Timer Interval Select 1 */
#define WDTIS2              (0x0004)  /* WDT - Timer Interval Select 2 */
#define WDTCNTCL            (0x0008)  /* WDT - Timer Clear */
#define WDTTMSEL            (0x0010)  /* WDT - Timer Mode Select */
#define WDTSSEL0            (0x0020)  /* WDT - Timer Clock Source Select 0 */
#define WDTSSEL1            (0x0040)  /* WDT - Timer Clock Source Select 1 */
#define WDTHOLD             (0x0080)  /* WDT - Timer hold */

/* WDTCTL Control Bits */
#define WDTIS0_L            (0x0001)  /* WDT - Timer Interval Select 0 */
#define WDTIS1_L            (0x0002)  /* WDT - Timer Interval Select 1 */
#define WDTIS2_L            (0x0004)  /* WDT - Timer Interval Select 2 */
#define WDTCNTCL_L          (0x0008)  /* WDT - Timer Clear */
#define WDTTMSEL_L          (0x0010)  /* WDT - Timer Mode Select */
#define WDTSSEL0_L          (0x0020)  /* WDT - Timer Clock Source Select 0 */
#define WDTSSEL1_L          (0x0040)  /* WDT - Timer Clock Source Select 1 */
#define WDTHOLD_L           (0x0080)  /* WDT - Timer hold */


#define WDTPW               (0x5A00)

#define WDTIS_0           (0x0000)  /* WDT - Timer Interval Select: /2G */
#define WDTIS_1           (0x0001)  /* WDT - Timer Interval Select: /128M */
#define WDTIS_2           (0x0002)  /* WDT - Timer Interval Select: /8192k */
#define WDTIS_3           (0x0003)  /* WDT - Timer Interval Select: /512k */
#define WDTIS_4           (0x0004)  /* WDT - Timer Interval Select: /32k */
#define WDTIS_5           (0x0005)  /* WDT - Timer Interval Select: /8192 */
#define WDTIS_6           (0x0006)  /* WDT - Timer Interval Select: /512 */
#define WDTIS_7           (0x0007)  /* WDT - Timer Interval Select: /64 */
#define WDTIS__2G         (0x0000)  /* WDT - Timer Interval Select: /2G */
#define WDTIS__128M       (0x0001)  /* WDT - Timer Interval Select: /128M */
#define WDTIS__8192K      (0x0002)  /* WDT - Timer Interval Select: /8192k */
#define WDTIS__512K       (0x0003)  /* WDT - Timer Interval Select: /512k */
#define WDTIS__32K        (0x0004)  /* WDT - Timer Interval Select: /32k */
#define WDTIS__8192       (0x0005)  /* WDT - Timer Interval Select: /8192 */
#define WDTIS__512        (0x0006)  /* WDT - Timer Interval Select: /512 */
#define WDTIS__64         (0x0007)  /* WDT - Timer Interval Select: /64 */

